import 'package:flutter/material.dart';
import 'package:velocity_x/velocity_x.dart';

class RulesScreen extends StatelessWidget {
  const RulesScreen({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
          backgroundColor: Colors.black87,
          centerTitle: true,
          title: const Text(
            'قوانین و مقررات',
            style: TextStyle(fontFamily: 'iransans', color: Color(0xfff04a24)),
          ),
        ),
        body: Container(
            height: MediaQuery.of(context).size.height,
            decoration: const BoxDecoration(
                gradient: LinearGradient(
                    begin: Alignment.centerLeft,
                    end: Alignment.centerRight,
                    colors: [
                  Color(0xff4e4f51),
                  Color(0xff808186),
                  Color(0xff4e4f51),
                ])),
            child: SingleChildScrollView(
              child: Directionality(
                textDirection: TextDirection.rtl,
                child: const Text(
                  """
﻿ماده ۱ - تعاریف و اصطلاحاتی که در این قوانین و مقررات به کار رفته است دارای معانی مشروح زیر است
۱-۱- مشتری: افرادی که در اپلیکیشن ایلام سرویس اعلام نیاز به خدمات کرده‌اند.
۲-۱- تعمیرکار: افرادی که در اپلیکیشن ایلام سرویس برای انجام خدمات اعلام آمادگی کرده‌اند.
۳-۱- کاربر: شخصی است که با فناوری ارتباطی به اپلیکیشن ایلام سرویس متصل و از خدمات نرم‌افزاری ایلام سرویس بهرمند می‌شود.
۴-۱- کاربران: مشتری‌ها و تعمیرکاران.
۵-۱- شرکت: ارائه‌دهندۀ سرویس ایلام سرویس.
۶-۱- ایلام سرویس: سرویسی که شرکت ایلام سرویس ارائه می‌دهد.
۷-۱- حساب کاربری: حسابی است که افراد برای استفاده از سرویس ایلام سرویس در نرم‌افزار ایلام سرویس ایجاد کرده‌اند.
۸-۱- اعتبار: مبلغی است که کاربران در حساب کاربری خود جهت استفاده از سرویس ایلام سرویس دارند.
۹-۱- اطلاعات محرمانه: اطلاعاتی که توسط کاربران مشتری و تعمیرکار در اختیار ایلام سرویس قرار داده می‌شود مانند شماره تماس، اقامتگاه، پست الکترونیکی و غیره.


ماده ۲ - حساب کاربری
۲-۱- کاربر با ثبت نام در ایلام سرویس می‌پذیرد که قوانین و مقررات ایلام سرویس را به صورت کامل مطالعه کرده و پذیرفته است. این قوانین ممکن است در طول زمان تغییر کند، استفادۀ مستمر کاربران از ایلام سرویس به معنی پذیرش هرگونه تغییر در قوانین و مقررات آن است.
۲-۲- برای استفاده از ایلام سرویس لازم است که هر کاربر یک حساب کاربری در ایلام سرویس بسازد. تنها افرادی که بیش از ۱۸ سال سن و واجد اهلیت قانونی باشند می‌توانند اقدام به ساختن حساب کاربری در ایلام سرویس کنند. برای استفاده از ایلام سرویس کاربر باید نام، نام خانوادگی، آدرس پست الکترونیکی و شماره همراه خود را در نرم‌افزار ایلام سرویس ثبت کند.
۳-۲- کاربر می‌پذیرد اطلاعات خواسته شده را به صورت صحیح و به‌ روز در سرویس ایلام سرویس وارد کند.
۴-۲- هر فرد تنها می‌تواند یک حساب کاربری به عنوان مشتری در ایلام سرویس داشته باشد.
۵-۲- مسئولیت همۀ فعالیت‌هایی که از طریق حساب کاربری اشخاص در ایلام سرویس یا سایر خدمات مربوط به ایلام سرویس انجام می‌شود به عهدۀ کاربر است.
۶-۲- مسئولیت حفظ امنیت اطلاعات حساب کاربری از جمله نام کاربری و رمز عبور به عهدۀ کاربر است. در صورت مفقود یا سرقت اطلاعات حساب کاربری، کاربر موظف است در اسرع وقت موضوع را به اطلاع شرکت برساند. بدیهی است تا زمانی که اطلاع‌رسانی به شرکت انجام نشده است مسئولیت همۀ فعالیت‌هایی که از طریق حساب کاربری مذکور انجام شده و می‌شود به عهدۀ کاربر خواهد بود.
۷-۲- کاربر حق ندارد به اشخاص حقیقی و حقوقی دیگر اجازه استفاده از حساب کاربری خود را بدهد یا حساب خود را به فرد یا شرکت دیگری منتقل کند.
۸-۲- در شرایط خاصی ممکن است از کاربر برای استفاده از سرویس، درخواست احراز هویت شود، در چنین شرایطی اگر کاربر اطلاعات کافی در اختیار شرکت قرار ندهد، شرکت می‌تواند حساب کاربری وی را مسدود کرده و از ارائۀ سرویس به کاربر خودداری کند.


ماده ۳ - استفاده از ایلام سرویس
۱-۳- ایلام سرویس متعهد می‌شوند در حین ارائه خدمات ایلام سرویس از استعمال دخانیات و هرگونه فعالیت نامتعارف که موجب آزردگی مشتری شود امتناع کنند.
۲-۳- با استفاده از سرویس ایلام سرویس کاربر می‌پذیرد که از ایلام سرویس برای انجام هیچ فعالیت غیر‌قانونی طبق قوانین جمهوری اسلامی ایران یا مخالف با عرف جامعه استفاده نکند. کاربر حق ندارد اشیاء غیر مجاز از جمله مشروبات الکلی، مواد مخدر، سلاح یا سایر اشیاء یا حیواناتی که طبق قانون جمهوری اسلامی ایران مجاز نیست همراه داشته باشد.
۳-۳- کاربر (مشتری) متعهد است در صورت داشتن هرگونه تقاضای نامتعارف و هر گونه پرنده یا حیوانات دیگر در منزل، موضوع را قبل از توافق بر انجام کار به کاربر تعمیرکار اعلام کند در غیر اینصورت چنانچه پس از پذیرش درخواست خدمت و عزیمت کاربر (تعمیرکار) به محل، مواجه با موارد فوق شود، مجاز به لغو (امتناع از انجام) سفارش بوده و مسئولیت جبران خسارات وارده برعهدۀ کاربر (مشتری) است.
۴-۳- کاربر متعهد می‌شود هیچ‌گاه از سرویس ایلام سرویس به صورتی که به ایلام سرویس یا شرکای آن صدمه‌ای وارد کند استفاده نکند.
۵-۳- کاربر می‌پذیرد که ایلام سرویس ممکن است از ارسال پیامک (SMS) به عنوان راه ارتباطی شرکت با وی استفاده کند. کاربر می‌تواند درخواست کند که ارسال این پیام‌ها قطع شود اما می‌پذیرد که با انصراف از دریافت این پیام‌ها، ممکن است در استفاده از سرویس با مشکل مواجه شود.
۶-۳- ایلام سرویس ممکن است کدهایی به منظور هدیه به کاربر ارائه کند که با وارد کردن این کدها در برنامه، یا درصدی از هزینه خدمات کاسته یا درصدی از هزینه خدمات پس از آن به کاربر برگردانده ‌شود و یا مبلغ مشخصی به حساب کاربر در ایلام سرویس اضافه می‌شود.
۷-۳- کاربر می‌پذیرد که اجازۀ انتقال یا فروش کدها را به افراد دیگر ندارد. همچنین کاربر مجاز نیست این کدها را به صورت عمومی منتشر کند (حتی اگر ایلام سرویس در فضاهای عمومی این کدها را منتشر کرده باشد) مگر اینکه ایلام سرویس رسماَ این اجازه را به آنها داده باشد.
۸-۳- کاربر می‌پذیرد اعتباری که در حساب کاربری خود دارد مستقل از روش کسب آن (اگر در نتیجه افزایش اعتبار از طریق درگاه بانک باشد یا در نتیجه وارد کردن کدهای تخفیفی که ایلام سرویس در اختیار آنها قرار می‌دهد یا هر روش دیگری) فقط برای استفاده از سرویس ایلام سرویس قابل استفاده است و امکان دریافت این وجه را به صورت نقد ندارد.
۹-۳- کاربر می‌پذیرد کدهایی که جهت افزایش اعتبار یا کاهش هزینه خدمات به آنها داده می‌شود ممکن است منقضی شوند. از آنجایی که ایلام سرویس برای ارائه این کدها هزینه ای از کاربران دریافت نمی‌کند، این حق برای شرکت محفوظ است که مبلغ یا درصد تاثیر این کدها را حتی پس از انتشار آنها تغییر دهد یا در صورت لزوم آنها را باطل کند. همچنین در صورتی که شرکت تشخیص دهد که استفاده از این کد به دلیل خطای فنی یا تخلف صورت گرفته و یا غیر قانونی بوده است می‌تواند این کدها یا اعتباری که در نتیجۀ استفاده از آنها به حساب کاربر اضافه شده است را باطل یا حذف کند.
۱۰-۳- مسئولیت تامین اینترنت و سخت‌افزار لازم و همچنین پرداخت هزینه‌های مربوط به آنها برای استفاده از سرویس ایلام سرویس به عهدۀ کاربر است.
۱۱-۳- کاربر (مشتری) متعهد می¬شود که زمان حضور و جنسیت تعمیرکار مورد نظر را از قبل اعلام کند تا ایلام سرویس بتواند با برنامه¬ریزی و طبق درخواست مشتری، کاربر (تعمیرکار) به محل اعزام کند.
۱۲-۳- کاربر متعهد می‌شود پس از اتمام خدمات از هیچ بخش از اطلاعاتی که در نتیجه استفاده از سرویس ایلام سرویس، از مشتریان یا تعمیرکاران کسب کرده است هیچ‌گونه استفاده‌ای نکند. طبعاً ذخیره کردن اطلاعات مشتریان یا تعمیرکاران در دستگاه تلفن همراه یا به هر شیوۀ دیگر نیز مغایر با قوانین ایلام سرویس خواهد بود. همچنین کاربر متعهد می‌شود در طول انجام خدمت، فقط در شرایط ضروری از اطلاعاتی که از مشتریان یا تعمیرکاران در سرویس ایلام سرویس ارائه شده است استفاده کند. استفادۀ کاربر از این اطلاعات باید مطابق با عرف جامعه و قوانین جمهوری اسلامی ایران باشد.
۱۳-۳- با استفاده از سرویس ایلام سرویس کاربر می‌پذیرد که در حین انجام خدمت، ایلام سرویس را وسیله‌ای برای تبلیغات و بازاریابی کالاهای شخصی خود قرار ندهد و از هرگونه معرفی و عرضۀ محصولات شخصی و یا محصولات متعلق به دیگران خودداری کند.
۱۴-۳- کاربر متعهد به رعایت همۀ قوانین اسلامی، شرعی، اخلاقی و اجتماعی جمهوری اسلامی ایران از جمله رعایت حجاب مناسب در هنگام استفاده از ایلام سرویس است.
۱۵-۳- کاربر می‌پذیرد که متن حریم شخصی ایلام سرویس را مطالعه کرده است و مورد قبول وی است.
۱۶-۳- کاربر می‌پذیرد که ایلام سرویس خدمات نظافت نیست بلکه تنها یک خدمات نرم‌افزاری است که ارتباط بین مشتریان و تعمیرکاران را جهت توافق بر انجام یک خدمت فراهم می‌کند. در سرویس ایلام سرویس تعمیرکار مختار است یک درخواست خدمت را بپذیرد یا رد کند، همچنین مشتری مختار است پس از ارسال درخواست خدمت، مشخص شدن تعمیرکار و قبل از آغاز عزیمت تعمیرکار به نقطه مبداء، خدمت را لغو کند یا خیر. لذا هر خدمتی که مشتری با تعمیرکار انجام می‌دهد باید به عنوان یک قرارداد لازم مستقل بین تعمیرکار و مشتری در نظر گرفته شود.
۱۷-۳- خدمات ایلام سرویس ممکن است با مشارکت خدمات شرکت‌های دیگری ارائه شود که شرکت ایلام سرویس کنترلی روی آنها ندارد. در چنین شرایطی کاربر می‌پذیرد که این خدمات، قوانین استفاده و مقررات مختص خود را دارند و ایلام سرویس مسئولیتی در خصوص قوانین و خدمات این شرکت‌ها ندارد.
۱۸-۳- کاربر مشتری می پذیرد که اسناد، مدارک و اشیای مهم و گرانبهای خود اعم از طلا، ارز، جواهرات و سایر اشیای قیمتی خود را بدون مواظبت در معرض کاربر تعمیرکار قرار ندهد و بر نگهداری آنها نظارت داشته باشد. همچنین قبل از خروج تعمیرکار تمامی لوازم منزل خود را کنترل نموده و هرگونه کاستی احتمالی را قبل از ترک تعمیرکار اطلاع دهد.
۱۹-۳- کاربر تعمیرکار بدیهی است که می پذیرد در حفظ و نگهداری تمامی اشیای منزل مشتری نهایت تلاش خود را بکند و در صورت هرگونه آسیب باید خود جوابگوی مشتری باشد.
۲۰-۳- کاربران پذیرفته‌اند که ایلام سرویس به عنوان یک نرم افزار عمل کرده و دو طرف را به هم معرفی و مرتبط می‌نماید. مسئولیت هرگونه آسیب به اموال طرفین بر عهده فرد خاطی بوده و طرفین می‌توانند در مراجع ذی صلاح حقوقی و قضایی علیه یکدیگر اقامه دعوی نمایند.


‌ماده ۴ – هزینه‌ها و پرداخت
۱-۴- کاربر می‌پذیرد امکان استرداد هزینه‌هایی که کاربر به ایلام سرویس می‌پردازد وجود ندارد.
۲-۴- کاربر می‌پذیرد هزینۀ سرویس از قبل از طرف تعمیرکار یا ایلام سرویس مشخص می‌شود و پس از استفاده از آن اعتراضی نسبت به هزینۀ سرویس نمی‌تواند داشته باشد.
۳-۴- پرداخت هزینۀ سرویس فقط از طریق روش‌هایی که توسط ایلام سرویس مشخص می‌شود، می‌تواند صورت گیرد. این روش‌ها عبارتند از پرداخت اعتباری از داخل برنامۀ موبایل، پرداخت اینترنتی برای افزایش اعتبار و پرداخت نقدی به تعمیرکار.
۴-۴- کاربر می‌پذیرد هزینۀ سرویس ارائه شده ممکن است بسته به ویژگی‌های سرویس ارائه شده از جمله نوع سرویس، زمان سرویس، مکان سرویس یا عوامل دیگر متغیر باشد.
۵-۴- کاربر می‌پذیرد که باید هزینۀ خدمت را مستقل از هر گونه مشکلی که ممکن است در برنامه ایلام سرویس جهت پرداخت آنلاین به وجود بیاید به شرکت پرداخت کند. در صورتی که به دلیل مشکلی در برنامه ایلام سرویس یا مشکلات ارتباطی از جمله اینترنت و شبکۀ تلفن همراه امکان پرداخت از طریق اپلیکیشن فراهم نشود مشتری همچنان موظف به پرداخت هزینه خدمت خواهد بود. در این شرایط پرداخت هزینه ممکن است با هماهنگی مشتری با دفتر شرکت ایلام سرویس یا روش‌های دیگر صورت پذیرد. در صورتی که مشتری به هر دلیلی از جمله مشکلات اپلیکیشن پرداخت را انجام نداده باشد، شرکت حق دارد مبلغ خدمت را از اعتبار کاربر در ایلام سرویس کسر کند.
۶-۴- کاربر می‌پذیرد هیچوقت درخواست ایلام سرویس ارسال نکند مگر اینکه قصد استفاده از سرویس ایلام سرویس را داشته باشد. کاربر مشتری اگر پس از ارسال درخواست سفارش و پذیرش درخواست توسط یک تعمیرکار، درخواست را لغو کند، یا در مکان مشخص شده به عنوان محل انجام خدمت در زمان مشخص حضور پیدا نکند و کاربر تعمیرکار اگر پس از قبول یک درخواست، درخواست را لغو کند یا پس از پذیرش درخواست در مکان مشخص شده به عنوان محل انحام خدمت حضور پیدا نکند شرکت می تواند بعلت عدم رعایت مقررات ایلام سرویس که منجر به عدم رعایت شهرت و اعتبار کاری او خواهد شد، هزینه‌ای به تشخیص خود به عنوان جریمه از اعتبار آنها کسر یا از کاربران وصول کند.
۷-۴- مشتری می‌پذیرد هر گونه تخریبی که در ابزار تعمیرکار در نتیجه استفاده از سرویس با حساب کاربری وی ایجاد شود، مسئولیت تامین هزینه‌های مربوط به تعمیر، تعویض و غیره به عهده وی خواهد بود. در چنین مواردی ایلام سرویس حق دارد این هزینه‌ها را از اعتبار موجود در حساب ایلام سرویس مشتری کسر یا از وی وصول کند.
۸-۴- کاربر تعمیرکار متعهد می‌شود که تقاضای هیچ گونه وجهی علاوه بر مقدار از پیش اعلام شده توسط نرم‌افزار نداشته باشد و هرگونه مطالبه وجه اضافه به هر عنوان ربطی به ایلام سرویس ندارد.
۹-۴- کاربر مشتری نیازی به پرداخت هرگونه وجه اضافه به هر عنوان از قبیل سختی کار، کمک بلاعوض یا قرض و غیره ندارد و پرداخت اضافی به انتخاب شخصی او بوده و ربطی به ایلام سرویس ندارد. ایلام سرویس این پرداخت اضافه را به هیچ عنوان تایید یا تشویق نمی¬کند و از کاربر مشتری می‌خواهد که این موارد را حتما به ایلام سرویس اطلاع دهد.


‌ماده ۵ - مسئولیت ایلام سرویس
۱-۵- ایلام سرویس با تمام امکانات خود از جمله واحدهای مرکز تماس، بازرسی و نظارت و میانجیگری، تمامی تلاش خود را جهت رضایت کاربران، رفع اختلافات ایجاد شده در زمان ارائه و استفادۀ خدمات ایلام سرویس بین کاربران و ایجاد صلح و سازش فی مابین آنها می‌کند.
۲-۵- ایلام سرویس با استفاده از نظارت‌های خود تلاش می‌کند سرویس با کیفیت به کاربران ارائه دهد.
۳-۵- ایلام سرویس تلاش خود را جهت استفاده از سرویس ارائه شده توسط کاربران محترم می‌کند اما تضمینی نسبت به اجرا شدن آن روی همۀ دستگاه‌ها یا همۀ شبکه‌های ارتباطی (اینترنت، شبکه تلفن‌همراه و …) نخواهد داد
۴-۵- تمامی اطلاعات کاربران به عنوان اطلاعات محرمانه نزد ایلام سرویس محافظت شده و دسترسی به آن توسط اشخاص ثالث ممنوع بوده مگر برابر تصمیم مقام صالح.
۵-۵- چنانچه هر یک از کاربران ایلام سرویس در زمان استفاده از خدمات آن با مشکلی مواجه شوند برابر شرایط فوق می‌توانند شکایت خود را از طریق مرکز تماس ایلام سرویس مطرح و ایلام سرویس پیگیری لازم و تلاش خود را جهت حل و فصل اختلافات بعمل خواهد آورد.


‌ماده ۶ – مسئولیت کاربران
۱-۶- مسئولیت همۀ اقدامات و افعال کاربران مشتری و تعمیرکار که ناشی از عدم رعایت قوانین موضوعه جمهوری اسلامی ایران از جمله قانون مجازات اسلامی (ارتکاب جرم در هنگام انجام خدمت) و قوانین مدنی (ورود خسارت به اموال کاربر) باشد، برعهدۀ شخص متخلف بوده و ایلام سرویس هیچ گونه مسئولیتی در قبال اعمال و افعال فوق نداشته و نخواهد داشت و ایلام سرویس می‌تواند ضمن غیر فعال کردن متخلف، از طریق مراجع صالح اقدامات قانونی را علیه نامبرده نسبت به احقاق حقوق قانونی ایلام سرویس بعمل آورد.
۲-۶- هرگونه اقدامی از سوی کاربران که منجر به ورود خسارت به شهرت تجاری، نام و اعتبار ایلام سرویس شود تخلف از شرایط قراردادی و قانونی تلقی و ایلام سرویس حق غیر فعال نمودن کاربر و اقدام قانونی علیه وی را جهت مطالبه خسارت و احقاق حقوق قانونی خود خواهد داشت.
۳-۶- کاربر تعمیرکار متعهد می‌شود تنها از علایم و اقلام سازمانی استفاده کند که توسط ایلام سرویس تهیه و در اختیار او گذاشته شده است (لباس کار یا ابزار نظافت) و مسئولیت استفاده از اقلام و علایمی که سبب ایجاد مشابهت و یا ایجاد اشتباه برای کاربران مشتری و یا سایر اشخاص اعم از حقیقی و یا حقوقی کند بر عهدۀ کاربر تعمیرکار بوده و در صورت لزوم ایلام سرویس به قطع سرویس با نامبرده و پیگیری قانونی اقدام خواهد نمود و شخص متخلف مکلف به جبران خسارات وارده به ایلام سرویس خواهد بود.
۴-۶- مسئولیت رعایت همۀ قوانین و مقررات کشوری برعهدۀ کاربران تعمیرکار است.
۵-۶- برای کلیه ی سفارشاتی که هزینه انجام آنها بیش از 200.000 تومان است کاربران باید نسبت به عقد قرارداد کتبی با یکدیگر اقدام نمایند تا در صورت بروز مشکل پیگیری از طریق ایلام سرویس یا مراجع قضایی تسهیل گردد. نمونه قرارداد در سایت و اپلیکیشن ایلام سرویس موجود است.


‌ماده ۷ – ضوابط رسیدگی به شکایات مربوط به سفارشات به شرح زیر است:
در موارد ذیل کاربر مشتری می‌تواند نسبت به اعلام شکایت یا نارضایتی از خدمات ایلام سرویس اقدام نماید:
۱-۷- دریافت دستمزد نامتعارف
۲-۷- عدم حضور تعمیرکار در زمان مقرر
۳-۷- کیفیت نامناسب کار: برای سرویس نظافت مشتری می‌تواند در حین حضور تعمیرکار در محل نسبت به اعلام نارضایتی از کیفیت سرویس اقدام نماید. مشتری می‌تواند در یک ساعت اول حضور تعمیرکار با توجه به کیفیت کار او از او بخواهد که محل را ترک کند و مبلغی پرداخت نکند. بعد از گذشت یک ساعت اول حضور تعمیرکار در محل مشتری، در صورت نارضایتی، مشتری می‌تواند ساعت حضور تعمیرکار را در اپلیکیشن وارد کرده و طبق زمان حضور تعمیرکار وجه را پرداخت نماید. سپس می‌تواند از محل‌هایی که نشان دهنده کیفیت نامناسب کار است عکس گرفته و برای واحد پشتیبانی ایلام سرویس ارسال نماید. کارشناسان ایلام سرویس با توجه به محتوای عکس‌ها طبق آیین نامه داخلی اقدام خواهند کرد و در صورت لزوم مابه التفاوت به مشتری عودت داده خواهد شد. در بقیه سرویس‌ها مشتری باید حین تحویل کار و قبل از پرداخت کامل وجه از کیفیت مطلوب کار اطمینان حاصل نماید و در صورت هرگونه مشکل قبل از پرداخت با پشتیبانی ایلام سرویس تماس بگیرد.
۴-۷- دزدی: در صورت وجود مستنداتی مبنی بر اینکه تعمیرکار مرتکب این کار شده واحد رسیدگی به شکایات ایلام سرویس پیگیری این موضوع را انجام خواهد داد. در صورت عدم وجود مستندات این اتهام قابل اثبات و پیگیری نخواهد بود.
۵-۷- خسارت دیدن لوازم مشتری: در این شرایط مشتری باید حداکثر تا 24 ساعت بعد از وقوع حادثه نسبت به اعلام خسارت اقدام کند. وقوع حادثه نیز حداکثر می‌تواند 14 روز بعد از اتمام کار باشد. در غیر این صورت، یعنی گذشت بیش از 14 روز از پایان کار و یا 24 ساعت از وقوع خسارت، این شکایت قابل رسیدگی نخواهد بود. هنگام وقوع خسارت تا زمان مراجعه کارشناس (از سمت شرکت بیمه یا ایلام سرویس) مشتری نباید دست به تغییر صحنه و از بین بردن نشانه‌های وقوع خسارت بزند تا بتوان خسارت را بررسی کرد.
۶-۷- عدم حل مشکل در خدمات مربوط به تعمیرات: حداکثر اگر طی 14 روز از پایان کار مشتری متوجه شود که عیب مورد نظر به طور کامل رفع نشده یا مجددا بازگشته است می تواند این موضوع را به پشتیبانی ایلام سرویس اعلام نماید و تعمیرکار موظف به مراجعه مجدد و حل نهایی موضوع است. چنانچه در این مرحله لازم باشد که جنس از محل خارج شود و به کارگاه تعمیرکار منتقل شود، مشتری باید سفارش مجدد ثبت نماید تا برای پیگیری‌های آتی دچار مشکل نشود.
۷-۷- درخواست کارشناس رسمی دادگستری: در صورتیکه به هر دلیل مشتری نظر یا میانجیگری کارشناسان ایلام سرویس را قبول نکند می‌تواند درخواست بررسی موضوع توسط کارشناس رسمی دادگستری بدهد. در صورتیکه کارشناس رسمی دادگستری نظر کارشناس ایلام سرویس را تایید کند مشتری می‌پذیرد که هزینه کارشناس رسمی دادگستری را پرداخت کند.


‌ماده ۸ - شرایط وسائل همراه کاربر بشرح زیر است:
۱-۸- وسایلی که مشتری نباید در محل داشته باشد عبارت است از مواد منفجره، محترقه، مواد سمی، اسیدی، بیماری زا و بد بو، مایعات و جامدات اتش زا و سوختی، مواد و وسایل رادیواکتیو.
۲-۸- وسایلی که تعمیرکار نباید در محل داشته باشد عبارت است از مواد منفجره، محترقه، مواد سمی، اسیدی، بیماری زا و بد بو، مایعات و جامدات آتش زا و سوختی، مواد و وسایل رادیواکتیو، هر گونه سلاح گرم و سرد و مواد مخدر و مشروبات الکلی و هر مواد دیگری که نامتعارف یا خلاف قوانین جمهوری اسلامی ایران است.
۳-۸- درخواست خدمت بدون حضور مشتری (مالک یا مستاجر یا وکیل ایشان) توسط کاربر ایلام سرویس ممنوع است و کاربر حق درخواست و انجام خدمت را نخواهد داشت، در صورت عدم رعایت، همۀ مسئولیت‌های ناشی از این تخلف برعهدۀ اقدام کنندگان آن است و ایلام سرویس حق دارد نسبت به قطع دسترسی اقدام و مبادرت به پیگیری قانونی از جمله مطالبۀ خسارت از شخص متخلف کند.


‌ماده ۹ - موارد فنی
۱-۹- کاربر حق ندارد هیچ‌گونه تلاشی در جهت استخراج سورس کد (Source Code) نرم‌افزارهای ایلام سرویس شامل دیکامپایل(Decompile) ، مهندسی معکوس(Reverse Engineering) یا فعالیت‌های مشابه انجام دهد، مگر اینکه اجازۀ چنین کاری به صورت قانونی صادر شده باشد.
۲-۹- کاربر مجاز نیست با استفاده از روش‌های Framing یا Mirroring یا روش‌های دیگر نسخۀ دیگری از سرویس ایلام سرویس را روی سرورهای دیگر ارائه کند. همچنین کاربر مجاز نیست در نرم‌افزار ایلام سرویس یا در روش ارائه سرویس ایلام سرویس تغییر یا اخلالی ایجاد کند.
۳-۹- کاربر حق ندارد برنامه یا اسکریپتی با هدف ایندکس گذاری (Indexing)، مطالعه یا هر گونه فعالیت داده‌کاوی روی سرویس اجرا کند.
۴-۹- کاربر حق ندارد هیچ فعالیتی در راستای حصول دسترسی غیرقانونی و غیر متداول به هیچ بخش سرویس ایلام سرویس یا سرویس های مرتبط با ایلام سرویس انجام دهد.


ماده ۱۰ - محتوای تولید شده توسط کاربران
ایلام سرویس ممکن است گاهی به کاربران اجازه دهد که در وب سایت، برنامه موبایل و یا سایر بخش‌های این سرویس عکس، متن، فایل صوتی، فایل تصویری یا فایل‌های مشابه منتشر کنند. مالکیت هر مطلب (شامل متن، عکس، فایل صوتی، فایل تصویری و …) که به این شکل در سرویس ثبت شود همچنان متعلق به کاربران خواهد بود اما با ثبت آنها در سرویس‌های مرتبط به ایلام سرویس کاربران این حق را به ایلام سرویس می‌دهند که آنها را در هر مکان و هر زمانی به صورت دیجیتال یا چاپی برای هر نوع کاربردی منتشر کند. همچنین ایلام سرویس مجاز است حق انتشار این مطالب را به اشخاص یا شرکت‌های دیگر منتقل کند.


‌ماده ۱۱ - قطع سرویس
ایلام سرویس در شرایطی که به هر دلیل به این نتیجه برسد حضور یک کاربر (تعمیرکار یا مشتری) می‌تواند برای شرکت یا سایر مشتریان یا تعمیرکاران خطرناک باشد یا مطلوب نباشد حق حذف دسترسی کاربر مذکور به سرویس ایلام سرویس را دارد.


‌ماده ۱۲ - توافق از راه دور
۱-۱۲- کاربر توافق می‌کند جهت مبادلۀ آسان اطلاعات، همۀ تغییرات و الحاقیه‌های قوانین و مقررات حاضر اعم از تغییر و اضافه کردن شروط آن، ارسال اخطاریه و ابلاغیه‌های مربوط به ایلام سرویس، از طریق سیستم رایانه‌ای ایلام سرویس بعمل آید و کاربر ضمن پذیرش اطلاع از شرط و روند اجرایی آن موافقت خود را نسبت به اعمال شرط مذکور اعلام می‌کند.
۲-۱۲- مسئولیت حفظ و حراست از حساب کاربر برعهدۀ کاربر بوده و کاربر ضمن پذیرش این مسئولیت، همۀ داده پیام‌های صادره از طریق حساب کاربری مذکور را منتسب به خود دانسته و هرگونه ادعایی نسبت به انکار، تردید و جعل داده پیام‌های ارسال شده از ناحیۀ نامبرده غیر قابل استماع و مردود است.
۳-۱۲- کاربر می‌پذیرد هر گونه رویه، اشکال، عبارات مبین تایید و اعلام قبولی و تصدیق داده پیام‌های صادره از طرف ایلام سرویس به منزله امضا الکترونیکی و قبولی محسوب می‌شود و هر گونه ادعایی نسبت به امضا و قبولی مذکور غیر قابل استماع و مردود است.
۴-۱۲- کاربر با عضویت در سرویس ایلام سرویس قصد و اراده خود را نسبت به پذیرش انعقاد هرگونه اقدام و عمل حقوقی از جمله عقود و معاملات از راه دور و از طریق سیستم رایانه‌ای و الکترونیکی اعلام می‌کند.
""",
                  style: TextStyle(
                      fontFamily: 'iransans', color: Color(0xf4f4f4f4)),
                ).pLTRB(20, 0, 20, 0),
              ),
            )));
  }
}
